### join

In [1]:
import pandas as pd
import pymysql

In [2]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [3]:
cur_1=conn1.cursor()

In [4]:
sql='''SELECT * FROM buytbl
	INNER JOIN usertbl
    ON buytbl.userID=usertbl.userID
ORDER BY num;'''

In [5]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [6]:
pd_1=pd.DataFrame(rows_1)
pd_1.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,2,KBS,운동화,None,60,2,KBS,김범수,1979,경남,011,2222222,173,2012-04-04
1,3,KBS,노트북,전자,2000,1,KBS,김범수,1979,경남,011,2222222,173,2012-04-04
2,4,JYP,모니터,전자,400,1,JYP,조용필,1950,경기,011,4444444,166,2009-04-04
3,5,BBK,모니터,전자,400,5,BBK,바비킴,1973,서울,010,0000000,176,2013-05-05
4,6,KBS,청바지,의류,100,3,KBS,김범수,1979,경남,011,2222222,173,2012-04-04

### JYP아이디만

In [7]:
import pandas as pd
import pymysql

In [8]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [9]:
cur_1=conn1.cursor()

In [10]:
sql='''SELECT * FROM buytbl
	INNER JOIN usertbl
    ON buytbl.userID=usertbl.userID
WHERE buytbl.userID='JYP';'''

In [11]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [12]:
pd_1=pd.DataFrame(rows_1)
pd_1.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,4,JYP,모니터,전자,400,1,JYP,조용필,1950,경기,011,4444444,166,2009-04-04

### 필요한 열만

In [13]:
import pandas as pd
import pymysql

In [14]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [15]:
cur_1=conn1.cursor()

In [16]:
sql='''SELECT buytbl.userID,name,prodName,addr,CONCAT(mobile1,mobile2) AS '연락처' FROM buytbl
	INNER JOIN usertbl
    ON buytbl.userID=usertbl.userID
ORDER BY num;'''

In [17]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [18]:
pd_1=pd.DataFrame(rows_1)
pd_1.head()

     0    1    2   3           4
0  KBS  김범수  운동화  경남  0112222222
1  KBS  김범수  노트북  경남  0112222222
2  JYP  조용필  모니터  경기  0114444444
3  BBK  바비킴  모니터  서울  0100000000
4  KBS  김범수  청바지  경남  0112222222

### 별칭 이용

In [19]:
import pandas as pd
import pymysql

In [20]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [21]:
cur_1=conn1.cursor()

In [22]:
sql='''SELECT B.userID,U.name,prodName,addr,CONCAT(mobile1,mobile2) AS '연락처' FROM buytbl B
	INNER JOIN usertbl U
    ON B.userID=U.userID
ORDER BY num;'''

In [23]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

### DISTINCT 사용

In [24]:
import pandas as pd
import pymysql

In [25]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [26]:
cur_1=conn1.cursor()

In [27]:
sql='''SELECT DISTINCT U.userID,U.name,U.addr  FROM usertbl U
	INNER JOIN buytbl B
    ON U.userID=B.userID
ORDER BY U.userID;'''

In [28]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [29]:
pd_1=pd.DataFrame(rows_1)
pd_1.head()

     0    1   2
0  BBK  바비킴  서울
1  EJW  은지원  경북
2  JYP  조용필  경기
3  KBS  김범수  경남
4  SSK  성시경  서울

### EXISTS 사용

In [30]:
import pandas as pd
import pymysql

In [31]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [32]:
cur_1=conn1.cursor()

In [33]:
sql='''SELECT DISTINCT U.userID,U.name,U.addr  FROM usertbl U
	WHERE EXISTS (
    SELECT * FROM buytbl B
    WHERE U.userID=B.userID);'''

In [34]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [35]:
pd_1=pd.DataFrame(rows_1)
pd_1.head()

     0    1   2
0  BBK  바비킴  서울
1  EJW  은지원  경북
2  JYP  조용필  경기
3  KBS  김범수  경남
4  SSK  성시경  서울

### 실습4

In [36]:
import pandas as pd
import pymysql

In [37]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [38]:
cur_1=conn1.cursor()

In [39]:
sql='''SELECT S.stdName,S.addr,C.clubName,C.roomNo FROM stdtbl S
	INNER JOIN stdclubtbl SC
    ON S.stdName=SC.stdName
    INNER JOIN clubtbl C 
    ON SC.clubName=C.clubName
    ORDER BY S.stdName;'''

In [40]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [41]:
pd_1=pd.DataFrame(rows_1)
pd_1.head()

     0   1   2     3
0  김범수  경남  바둑  102호
1  김범수  경남  축구  103호
2  김범수  경남  바둑  102호
3  김범수  경남  축구  103호
4  바비킴  서울  봉사  104호

In [42]:
import pandas as pd
import pymysql

In [43]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [44]:
cur_1=conn1.cursor()

In [45]:
sql='''SELECT C.clubName,C.roomNo,S.stdName,S.addr FROM stdtbl S
	INNER JOIN stdclubtbl SC
    ON SC.stdName=S.stdName
    INNER JOIN clubtbl C 
    ON SC.clubName=C.clubName
    ORDER BY C.clubName;'''

In [46]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [47]:
pd_1=pd.DataFrame(rows_1)
pd_1.head()

    0     1    2   3
0  바둑  102호  김범수  경남
1  바둑  102호  김범수  경남
2  봉사  104호  은지원  경북
3  봉사  104호  바비킴  서울
4  봉사  104호  은지원  경북